import { Data } from "../types";

export const HEADERS = [
	"סמל ועדה",
	"שם ישוב",
	"סמל ישוב",
	"בעלי זכות בחירה",
	"מצביעים",
	"פסולים",
	"כשרים",
	"אמת",
	"אצ",
	"ב",
	"ג",
	"ד",
	"ום",
	"ז",
	"זך",
	"זנ",
	"זץ",
	"ט",
	"י",
	"יז",
	"ינ",
	"יץ",
	"יק",
	"כן",
	"ך",
	"ל",
	"מחל",
	"מרצ",
	"נז",
	"ני",
	"נף",
	"נץ",
	"נק",
	"נר",
	"עם",
	"פה",
	"ף",
	"צ",
	"ץ",
	"ק",
	"קי",
	"קך",
	"קנ",
	"קץ",
	"רז",
	"שס",
	"ת",
];

const names: [string, string][] = [
	["הליכוד בהנהגת בנימין נתניהו לראשות הממשלה", "מחל"],
	["יש עתיד בראשות יאיר לפיד לראשות הממשלה", "פה"],
	["הציונות הדתית בראשות בצלאל סמוטריץ` ועוצמה יהודית", "ט"],
	["המחנה הממלכתי בהנהגת בני גנץ לראשות הממשלה", "כן"],
	["התאחדות הספרדים שומרי תורה תנועתו של מרן הרב עובדי", "שס"],
	["יהדות התורה והשבת אגודת ישראל - דגל התורה", "ג"],
	["ישראל ביתנו בראשות אביגדור ליברמן", "ל"],
	["הרשימה הערבית המאוחדת", "עם"],
	['חד"ש תע"ל בראשות איימן עודה ואחמד טיבי', "ום"],
	["מפלגת העבודה בראשות מרב מיכאלי", "אמת"],
	["מרצ השמאל של ישראל בראשות זהבה גלאון", "מרצ"],
	['בל"ד - אלתג`מוע אלווטני אלדמוקרטי בראשות סמי אבו ש', "ד"],
	["הבית היהודי בראשות איילת שקד", "ב"],
	["באומץ בשבילך", "קץ"],
	["חופש כלכלי בראשות אביר קארה", "אצ"],
	["הכלכלית החדשה בראשות פרופסור ירון זליכה", "יז"],
	["צעירים בוערים בהנהגת הדר מוכתר", "צ"],
	["דעת טוב ורע וברית שבט אברהם-עלה ירוק ואוסרת אל איס", "ת"],
	["קול הסביבה והחי", "ק"],
	["נתיב - נחיה תמיד יחד בכבוד", "ני"],
	["אני ואתה", "ך"],
	["הפיראטים- הכי טוב לדעתי אני רוצה להיות שם", "ף"],
	["כל קול קובע נועם קולמן ולירון עופרי לראשות הממשלה", "קנ"],
	["ישראל חופשית דמוקרטית בראשות אלי אבידר", "י"],
	["סדר חדש- למען האזרחים הותיקים בישראל", "קך"],
	["יש כיוון בראשות עמוס דב סילבר", "נק"],
	["העצמאים החדשים בראשות יורם מועלמי", "נץ"],
	["מנהיגות חברתית", "ץ"],
	["רשימת שלושים\\ארבעים בראשות סטלה ויינשטיין", "רז"],
	['כבוד האדם בראשות עו"ד ארקדי פוגץ`', "נז"],
	["שחר כוח חברתי בראשות וג`די טאהר", "ז"],
	['מפלגת הגוש התנ"כי', "יק"],
	['"אנחנו" - בראשות עו"ד מוש חוג`ה', "נר"],
	["הלב היהודי בראשות אלי יוסף", "קי"],
	["צומת בראשות משה גרין דרכו של רפול", "זץ"],
	["מפלגת שמע בראשות נפתלי גולדמן", "נף"],
	["צו השעה", "יץ"],
	["איחוד בני הברית -בראשות רב חובל בשארה שליאן", "ינ"],
	['קמ"ה - קידום מעמד הפרט', "זך"],
	["כח להשפיע בראשות בני אלבז", "זנ"],
];

names.push(...names.map((cell): [string, string] => [cell[1], cell[0]]));

export const NAMES = new Map<string, string>(names);

export function getColumn(data: Data, row: number): string[] {
	return data.map((line) => line[row]);
}

export function canVoteNumber(data: Data): number {
	return getColumn(data, 3)
		.map((i) => Number(i) || 0)
		.reduce((p, c) => p + c);
}

export function voted(data: Data): number {
	return getColumn(data, 4)
		.map((i) => Number(i) || 0)
		.reduce((p, c) => p + c);
}
